Repository: matheusever0/Equilibrium
Catalog: src/FinanceSystem.API/Resources/SharedResource.*.resx
Languages: pt_br

# Error.NotFound
source: {0} with ID {1} not found
pt_br: {0} com ID {1} não encontrado

# Error.InvalidOperation
source: Invalid operation: {0}
pt_br: Operação inválida: {0}

# Error.Unauthorized
source: Unauthorized access: {0}
pt_br: Acesso não autorizado: {0}

# Error.Generic
source: An unexpected error occurred
pt_br: Ocorreu um erro inesperado

# Error.InvalidArgument
source: Invalid argument: {0}
pt_br: Argumento inválido: {0}

# Entity.NotFound
source: {0} with ID {1} not found
pt_br: {0} com ID {1} não encontrado

# Auth.LoginAttempt
source: Login attempt for user: {0}
pt_br: Tentativa de login para usuário: {0}

# Auth.LoginSuccess
source: Successful login for user: {0}
pt_br: Login bem-sucedido para usuário: {0}

# Auth.LoginFailed
source: Failed login for user: {0}
pt_br: Falha no login para usuário: {0}

# Auth.TokenValid
source: Valid token for user: {0}
pt_br: Token válido para usuário: {0}

# Auth.TokenInvalid
source: Invalid or expired token
pt_br: Token inválido ou expirado

# Auth.TokenVerifyError
source: Error verifying token
pt_br: Erro ao verificar token

# User.GetAll
source: Getting all users
pt_br: Obtendo todos os usuários

# User.Get
source: Getting user with ID: {0}
pt_br: Obtendo usuário com ID: {0}

# User.Create
source: Creating new user: {0}
pt_br: Criando novo usuário: {0}

# User.Update
source: Updating user with ID: {0}
pt_br: Atualizando usuário com ID: {0}

# User.Delete
source: Deleting user with ID: {0}
pt_br: Excluindo usuário com ID: {0}

# User.NotFound
source: User with ID {0} not found
pt_br: Usuário com ID {0} não encontrado

# User.Unauthorized
source: User attempted to access user data that doesn't belong to them
pt_br: Usuário tentou acessar dados de usuário que não pertencem a ele

# Payment.GetAll
source: Getting all payments for user
pt_br: Obtendo todos os pagamentos para o usuário

# Payment.Get
source: Getting payment with ID: {0}
pt_br: Obtendo pagamento com ID: {0}

# Payment.Create
source: Creating new payment
pt_br: Criando novo pagamento

# Payment.Update
source: Updating payment with ID: {0}
pt_br: Atualizando pagamento com ID: {0}

# Payment.Delete
source: Deleting payment with ID: {0}
pt_br: Excluindo pagamento com ID: {0}

# Payment.NotFound
source: Payment with ID {0} not found
pt_br: Pagamento com ID {0} não encontrado

# Payment.Unauthorized
source: User attempted to access payment that doesn't belong to them. PaymentId: {0}
pt_br: Usuário tentou acessar pagamento que não pertence a ele. ID do pagamento: {0}

# Payment.GetByMonth
source: Getting payments for {0}/{1}
pt_br: Obtendo pagamentos para {0}/{1}

# Payment.InvalidMonth
source: Month must be between 1 and 12
pt_br: Mês deve estar entre 1 e 12

# Payment.CannotDeletePaid
source: Cannot delete a paid payment
pt_br: Não é possível excluir um pagamento já pago

# Payment.MarkAsPaid
source: Marking payment with ID: {0} as paid
pt_br: Marcando pagamento com ID: {0} como pago

# Payment.MarkAsOverdue
source: Marking payment with ID: {0} as overdue
pt_br: Marcando pagamento com ID: {0} como vencido

# Payment.Cancel
source: Cancelling payment with ID: {0}
pt_br: Cancelando pagamento com ID: {0}

# Income.GetAll
source: Getting all incomes for user
pt_br: Obtendo todos os recebimentos para o usuário

# Income.Get
source: Getting income with ID: {0}
pt_br: Obtendo recebimento com ID: {0}

# Income.Create
source: Creating new income
pt_br: Criando novo recebimento

# Income.Update
source: Updating income with ID: {0}
pt_br: Atualizando recebimento com ID: {0}

# Income.Delete
source: Deleting income with ID: {0}
pt_br: Excluindo recebimento com ID: {0}

# Income.NotFound
source: Income with ID {0} not found
pt_br: Recebimento com ID {0} não encontrado

# Income.Unauthorized
source: User attempted to access income that doesn't belong to them. IncomeId: {0}
pt_br: Usuário tentou acessar recebimento que não pertence a ele. ID do recebimento: {0}

# Income.GetByMonth
source: Getting incomes for {0}/{1}
pt_br: Obtendo recebimentos para {0}/{1}

# Income.InvalidMonth
source: Month must be between 1 and 12
pt_br: Mês deve estar entre 1 e 12

# Income.CannotDeleteReceived
source: Cannot delete a received income
pt_br: Não é possível excluir um recebimento já recebido

# Income.MarkAsReceived
source: Marking income with ID: {0} as received
pt_br: Marcando recebimento com ID: {0} como recebido

# Income.Cancel
source: Cancelling income with ID: {0}
pt_br: Cancelando recebimento com ID: {0}

# PaymentType.GetAll
source: Getting all payment types for user
pt_br: Obtendo todos os tipos de pagamento para o usuário

# PaymentType.Get
source: Getting payment type with ID: {0}
pt_br: Obtendo tipo de pagamento com ID: {0}

# PaymentType.Create
source: Creating new payment type
pt_br: Criando novo tipo de pagamento

# PaymentType.Update
source: Updating payment type with ID: {0}
pt_br: Atualizando tipo de pagamento com ID: {0}

# PaymentType.Delete
source: Deleting payment type with ID: {0}
pt_br: Excluindo tipo de pagamento com ID: {0}

# PaymentType.NotFound
source: Payment type with ID {0} not found
pt_br: Tipo de pagamento com ID {0} não encontrado

# PaymentType.Unauthorized
source: User attempted to access payment type that doesn't belong to them
pt_br: Usuário tentou acessar tipo de pagamento que não pertence a ele

# PaymentType.SystemUpdate
source: User attempted to update a system payment type. TypeId: {0}
pt_br: Usuário tentou atualizar um tipo de pagamento do sistema. ID do tipo: {0}

# PaymentType.CannotUpdateSystem
source: Cannot update system payment type
pt_br: Não é possível atualizar tipos de pagamento do sistema

# PaymentType.CannotDeleteSystem
source: Cannot delete system payment type
pt_br: Não é possível excluir tipos de pagamento do sistema

# IncomeType.GetAll
source: Getting all income types for user
pt_br: Obtendo todos os tipos de recebimento para o usuário

# IncomeType.Get
source: Getting income type with ID: {0}
pt_br: Obtendo tipo de recebimento com ID: {0}

# IncomeType.Create
source: Creating new income type
pt_br: Criando novo tipo de recebimento

# IncomeType.Update
source: Updating income type with ID: {0}
pt_br: Atualizando tipo de recebimento com ID: {0}

# IncomeType.Delete
source: Deleting income type with ID: {0}
pt_br: Excluindo tipo de recebimento com ID: {0}

# IncomeType.NotFound
source: Income type with ID {0} not found
pt_br: Tipo de recebimento com ID {0} não encontrado

# IncomeType.Unauthorized
source: User attempted to access income type that doesn't belong to them
pt_br: Usuário tentou acessar tipo de recebimento que não pertence a ele

# IncomeType.SystemUpdate
source: User attempted to update a system income type. TypeId: {0}
pt_br: Usuário tentou atualizar um tipo de recebimento do sistema. ID do tipo: {0}

# IncomeType.CannotUpdateSystem
source: Cannot update system income type
pt_br: Não é possível atualizar tipos de recebimento do sistema

# IncomeType.CannotDeleteSystem
source: Cannot delete system income type
pt_br: Não é possível excluir tipos de recebimento do sistema

# PaymentMethod.GetAll
source: Getting all payment methods for user
pt_br: Obtendo todos os métodos de pagamento para o usuário

# PaymentMethod.Get
source: Getting payment method with ID: {0}
pt_br: Obtendo método de pagamento com ID: {0}

# PaymentMethod.Create
source: Creating new payment method
pt_br: Criando novo método de pagamento

# PaymentMethod.Update
source: Updating payment method with ID: {0}
pt_br: Atualizando método de pagamento com ID: {0}

# PaymentMethod.Delete
source: Deleting payment method with ID: {0}
pt_br: Excluindo método de pagamento com ID: {0}

# PaymentMethod.NotFound
source: Payment method with ID {0} not found
pt_br: Método de pagamento com ID {0} não encontrado

# PaymentMethod.Unauthorized
source: User attempted to access payment method that doesn't belong to them
pt_br: Usuário tentou acessar método de pagamento que não pertence a ele

# PaymentMethod.SystemUpdate
source: User attempted to update a system payment method. MethodId: {0}
pt_br: Usuário tentou atualizar um método de pagamento do sistema. ID do método: {0}

# PaymentMethod.CannotUpdateSystem
source: Cannot update system payment method
pt_br: Não é possível atualizar métodos de pagamento do sistema

# PaymentMethod.CannotDeleteSystem
source: Cannot delete system payment method
pt_br: Não é possível excluir métodos de pagamento do sistema

# CreditCard.GetAll
source: Getting all credit cards for user
pt_br: Obtendo todos os cartões de crédito para o usuário

# CreditCard.Get
source: Getting credit card with ID: {0}
pt_br: Obtendo cartão de crédito com ID: {0}

# CreditCard.Create
source: Creating new credit card
pt_br: Criando novo cartão de crédito

# CreditCard.Update
source: Updating credit card with ID: {0}
pt_br: Atualizando cartão de crédito com ID: {0}

# CreditCard.Delete
source: Deleting credit card with ID: {0}
pt_br: Excluindo cartão de crédito com ID: {0}

# CreditCard.NotFound
source: Credit card with ID {0} not found
pt_br: Cartão de crédito com ID {0} não encontrado

# CreditCard.Unauthorized
source: User attempted to access credit card that doesn't belong to them
pt_br: Usuário tentou acessar cartão de crédito que não pertence a ele

# CreditCard.InsufficientLimit
source: Insufficient credit card limit
pt_br: Limite de cartão de crédito insuficiente

# PaymentInstallment.GetAll
source: Getting all installments for payment ID: {0}
pt_br: Obtendo todas as parcelas para o pagamento ID: {0}

# PaymentInstallment.Get
source: Getting installment with ID: {0}
pt_br: Obtendo parcela com ID: {0}

# PaymentInstallment.NotFound
source: Payment installment with ID {0} not found
pt_br: Parcela de pagamento com ID {0} não encontrada

# PaymentInstallment.Unauthorized
source: User attempted to access payment installment that doesn't belong to them
pt_br: Usuário tentou acessar parcela que não pertence a ele

# PaymentInstallment.MarkAsPaid
source: Marking installment with ID: {0} as paid
pt_br: Marcando parcela com ID: {0} como paga

# PaymentInstallment.MarkAsOverdue
source: Marking installment with ID: {0} as overdue
pt_br: Marcando parcela com ID: {0} como vencida

# PaymentInstallment.Cancel
source: Cancelling installment with ID: {0}
pt_br: Cancelando parcela com ID: {0}

# IncomeInstallment.GetAll
source: Getting all installments for income ID: {0}
pt_br: Obtendo todas as parcelas para o recebimento ID: {0}

# IncomeInstallment.Get
source: Getting installment with ID: {0}
pt_br: Obtendo parcela com ID: {0}

# IncomeInstallment.NotFound
source: Income installment with ID {0} not found
pt_br: Parcela de recebimento com ID {0} não encontrada

# IncomeInstallment.Unauthorized
source: User attempted to access income installment that doesn't belong to them
pt_br: Usuário tentou acessar parcela que não pertence a ele

# IncomeInstallment.MarkAsReceived
source: Marking installment with ID: {0} as received
pt_br: Marcando parcela com ID: {0} como recebida

# IncomeInstallment.Cancel
source: Cancelling installment with ID: {0}
pt_br: Cancelando parcela com ID: {0}

# Role.GetAll
source: Getting all roles
pt_br: Obtendo todos os perfis

# Role.Get
source: Getting role with ID: {0}
pt_br: Obtendo perfil com ID: {0}

# Role.Create
source: Creating new role: {0}
pt_br: Criando novo perfil: {0}

# Role.Update
source: Updating role with ID: {0}
pt_br: Atualizando perfil com ID: {0}

# Role.Delete
source: Deleting role with ID: {0}
pt_br: Excluindo perfil com ID: {0}

# Role.NotFound
source: Role with ID {0} not found
pt_br: Perfil com ID {0} não encontrado

# Role.CannotDeleteAssigned
source: Cannot delete role because it is assigned to users
pt_br: Não é possível excluir perfil pois está atribuído a usuários

# Permission.GetAll
source: Getting all permissions
pt_br: Obtendo todas as permissões

# Permission.Get
source: Getting permission with ID: {0}
pt_br: Obtendo permissão com ID: {0}

# Permission.Create
source: Creating new permission: {0}
pt_br: Criando nova permissão: {0}

# Permission.Update
source: Updating permission with ID: {0}
pt_br: Atualizando permissão com ID: {0}

# Permission.Delete
source: Deleting permission with ID: {0}
pt_br: Excluindo permissão com ID: {0}

# Permission.NotFound
source: Permission with ID {0} not found
pt_br: Permissão com ID {0} não encontrada

# Permission.GetForRole
source: Getting permissions for role ID: {0}
pt_br: Obtendo permissões para o perfil ID: {0}

# Permission.GetForUser
source: Getting permissions for user ID: {0}
pt_br: Obtendo permissões para o usuário ID: {0}

# Auth.InvalidCredentials
source: Invalid username or password
pt_br: Nome de usuário ou senha inválidos

# Auth.UserDeactivated
source: User account is deactivated
pt_br: O usuário está desativado
