Repository: matheusever0/Equilibrium
Catalog: src/FinanceSystem.Resources.Web/ResourceFinanceWeb.*.resx
Languages: pt_br

# Error_Loading
source: Error loading {0}: {1}
pt_br: Erro ao carregar {0}: {1}

# Error_Creating
source: Error creating {0}: {1}
pt_br: Erro ao criar {0}: {1}

# Error_Updating
source: Error updating {0}: {1}
pt_br: Erro ao atualizar {0}: {1}

# Error_Deleting
source: Error deleting {0}: {1}
pt_br: Erro ao excluir {0}: {1}

# Error_PreparingForm
source: Error preparing form: {0}
pt_br: Erro ao preparar formulário: {0}

# Error_ParentEntityNotFound
source: Could not identify the {0} related to this installment.
pt_br: Não foi possível identificar o {0} relacionado a esta parcela.

# Error_CannotEditSystemEntity
source: Cannot edit system {0}.
pt_br: Não é possível editar {0} do sistema.

# Error_CannotDeleteSystemEntity
source: Cannot delete system {0}.
pt_br: Não é possível excluir {0} do sistema.

# Error_MarkStatus
source: Error marking {0} as {1}: {2}
pt_br: Erro ao marcar {0} como {1}: {2}

# Error_CancelEntity
source: Error canceling {0}: {1}
pt_br: Erro ao cancelar {0}: {1}

# Error_Generating
source: Error generating {0}: {1}
pt_br: Erro ao gerar {0}: {1}

# Error_RefreshingPrice
source: Error refreshing price: {0}
pt_br: Erro ao atualizar preço: {0}

# Error_AuthenticationFailed
source: Authentication failed
pt_br: Falha na autenticação

# Error_InvalidToken
source: Invalid token
pt_br: Token inválido

# Error_IdentityGeneration
source: Failed to generate identity
pt_br: Falha ao gerar identidade

# Error_Logout
source: Error logging out: {0}
pt_br: Erro ao fazer logout: {0}

# Error_PermissionDenied
source: You do not have permission to edit other users, only your own.
pt_br: Você não tem permissão para editar outros usuários, apenas o seu.

# Error_CreditCardRequired
source: Credit card is required for this payment method.
pt_br: Cartão de crédito é obrigatório para este método de pagamento.

# Success_Created
source: {0} created successfully!
pt_br: {0} criado com sucesso!

# Success_Updated
source: {0} updated successfully!
pt_br: {0} atualizado com sucesso!

# Success_Deleted
source: {0} deleted successfully!
pt_br: {0} excluído com sucesso!

# Success_StatusChanged
source: {0} marked as {1} successfully!
pt_br: {0} marcado como {1} com sucesso!

# Success_Canceled
source: {0} canceled successfully!
pt_br: {0} cancelado com sucesso!

# Success_Login
source: Login successful!
pt_br: Login realizado com sucesso!

# Validation_SelectRole
source: You must select at least one role.
pt_br: É necessário selecionar pelo menos um perfil.

# Validation_EmailRequired
source: An email is required.
pt_br: É necessário ter um email cadastrado.
